cricket2009/SpO2_MSP430/MSP430F5528/AFE44x0_main.c
/*  
 * ======== AFE44x0_main.c ========
 * AFE44x0 Pulse Oximeter
 *
 * 
 *
 * ---------------------------------------------------------------------------*/

//--------------------------------------------------------------------------------

#include <intrinsics.h>
#include <string.h>
#include <stdlib.h>
#include <math.h>
#include "msp430.h"
//#include "descriptors.h"

//#include "device.h"
#include "types.h"               //Basic Type declarations

#include "HAL_UCS.h"
#include "HAL_PMM.h"

#include "AFE44x0.h"
//#include "AFE44x0_FWVersion.h"
#include "AFE44x0_main.h"

#include "msp430f5528.h"

#include "AFE44x0.h"


#include "Spo2_Functions.h"   

#include "hal_battery_monitor.h"
#include "hal_SDcard.h"
#include "exfuns.h"
#include "ff.h"
#include "hal_uart_cc2530.h"
#include "PingPongBuf.h"
//==============================================================================

#define SYS_CLK 16000000 //15597800    // 16Mhz


unsigned long AFE44xx_SPO2_Data_buf[2];

char sendDataFlag = 0;
char readDataFlag = 0;

int Fs= 80;
int Fs_OLED = 5;
//#define Fs 80     // 采样率

#define MA_N  20   //第一次滑动平均滤波阶数 Fs/10


unsigned long MA_buf_Led1[MA_N] = {0}; // 滑动滤波数据缓存区
unsigned long MA_buf_Led2[MA_N] = {0};


unsigned long MAF_data_Led1 = 0;       // 滑动滤波后结果
unsigned long MAF_data_Led2 = 0;
unsigned long MAF_data_Led1_new =0;
unsigned long MAF_data_Led2_new =0;

unsigned long Led1_DC = 0;
unsigned long Led1_DC_new = 0;
unsigned long Led2_DC = 0;
unsigned long Led2_DC_new = 0;

//unsigned long Led1_AC = 0;
//unsigned long Led1_AC_new = 0;
//unsigned long Led2_AC = 0;
//unsigned long Led2_AC_new = 0;

float Led1_AC = 0;
float Led1_AC_new = 0;
float Led2_AC = 0;
float Led2_AC_new = 0;



signed int MAF_data_Led1_diff = 0;
signed int MAF_data_Led2_diff = 0;

unsigned int MAF_data_Led2_diff_abs = 0;


float R = 0.0;
float R1 = 0.0;
float R2 = 0.0;

unsigned int R1_temp = 0;
unsigned int R2_temp = 0;


float spo2_average = 0.0;
float spo2_average_prev = 0.0;
float spo2_out = 0.0;
float spo2_sum = 0.0;
//#define SPO2_BUF_L 100 
//float spo2_buf[SPO2_BUF_L] = {0.0};
int spo2_buf_len = 0;
int spo2_flag = 0;
int spo2_count = 0;
float spo2_temp = 0.0;
float spo2_instant = 0.0;
float spo2_instant1 = 0.0;
int  spo2 = 0;
int  spo2_prev = 0;
float spo2_instant1_sum = 0.0;

#define SPO2_N 160    // 血氧计算数据窗口，取3s平均

unsigned long dc_led1_buf[SPO2_N] = {0};
unsigned long dc_led2_buf[SPO2_N] = {0};
//unsigned int ac_led1_buf[SPO2_N] = {0};
//unsigned int ac_led2_buf[SPO2_N] = {0};
float ac_led1_buf[SPO2_N] = {0};
float ac_led2_buf[SPO2_N] = {0};




unsigned long led_up_val = 1200000;  // 范围
unsigned long led_very_up_val = 1300000;  // 范围
unsigned long led_low_val = 600000;
unsigned long led_very_low_val = 500000;

UCHAR small_change = 1;  // 光强改变步长
UCHAR fast_change = 5;
UCHAR led1_current = 0x14;  // led1电流初始值
UCHAR led2_current = 0x14;
unsigned long current_reg_val =  0x011414;    // Reg34:LEDCNTRL: LED CONTROL REGISTER 初始值，初始电流 Red：3.90625mA, IR:3.90625mA

#define NRCOEFF 0.985 
float temp1 = 0.0;
float temp2 = 0.0;
signed int Led1_HR_AC_prev = 0;
signed int Led1_HR_AC =0;
signed int Led2_HR_AC_prev = 0;
signed int Led2_HR_AC =0;

signed int MAF_data_Led1_HR_ac = 0;

//#define MA_NAC  20  //对AC滑动平均滤波阶数

signed int MAF_buf_Led1_diff_ac[] = {0}; // 微分后数据缓存区 



int window_move_count = 0; //窗口移动次数计数
int sum_count =0;
unsigned long sum = 0;

int window_move_count_old = 0;
#define HR_window_L  30  //初始窗口长度为小于采样率一半
//
signed int HR_window[HR_window_L] = {0}; // 初始化窗口数据
int peak_count = 0; // 峰值个数计数
signed int local_max = 0;
int max_location = 0;
unsigned long LED_count = 0;
//float HR_interval_average = 0.0;
float HR_instant =0;
unsigned long HR_instant_temp =0;
float HR_average = 0;
float HR_average_prev = 0;

int HR_count = 0;

#define HR_BUF_L 10
float HR_buf[HR_BUF_L] = {0.0};

float HR_diff_average = 0;
float HR_diff_average_prev = 0;
float HR_diff_buf[HR_BUF_L] = {0.0};



int count = 0;
#define SUM_DIFF_AC_BUF_L 5
unsigned int sum_diff_ac_buf[SUM_DIFF_AC_BUF_L] = {0};
unsigned int sum_diff_ac = 0;
unsigned long sum_diff_ac_old =0;
unsigned long threshold_diff_ac =0;
unsigned long threshold_diff_ac_sum = 0;

signed int  MAF_data_Led2_diff_old = 0;

int HR_instant_buf[30] ={0};


int num =0;
int cycle_num = 0;
int cycle_num_OLED = 0;
#define HR_diff_window_L  30

signed int HR_diff_window[HR_diff_window_L] ={0};

int diff_window_move_count =0;
int local_diff_max = 0;
//int local_diff_max_old1 = 0;
//int local_diff_max_old2 = 0;

int local_diff_max_buf[3] = {0};


int max_diff_location = 0;
unsigned long sum_diff = 0;
int sum_diff_count = 0;
float HR_diff_instant = 0.0;

int HR_diff_instant_buf[30]={0};

int HR = 75;
int HR_prev = 0;
int HR_diff = 0;
int HR_diff_old = 0;
int HR_raw = 0;
int HR_raw_old = 0;
int HR_old = 75;
int HR_update = 0;
unsigned char txString[4] = "";
int send_num =0;

int Finger_out = 0;

extern void write_oled_command(unsigned char ucCmd);
extern void write_oled_data(unsigned char ucData);

SpO2SystemStatus_t SpO2SystemStatus;
int Finger_out_num = 0;   //手指离开状态计数器


int HR_diff_count = 0; // 对通过AC差分信号计算出的心率值的次数进行计数
int HR_OLED_flag = 0;  // 初始化后开始更新OLED的HR的标志，若为1则开始更新OLED

//延时计数
int Device_waite_time1;

// pingPong buffer
PingPongBuf_t *pingPongBuf_ForSD;
uint8 bufferSend[3] = {DATA_START,DATA_START,DATA_END};
// 初始化之前就关闭看门狗，不然初始化时间过长，会造成系统不断复位
int __low_level_init(void)
{
  // stop WDT
  WDTCTL = WDTPW + WDTHOLD;
 
  // Perform data segment initialization
  return 1;
}

/*  
 * ======== main ========
 */
void main (void)
{
    //关闭看门狗 
    WDTCTL = WDTPW + WDTHOLD;                                   //Stop watchdog timer
    //系统初始化
    SpO2SystemStatus = SpO2_OFFLINE_IDLE;    //默认普通显示状态
    Init_Ports();                                               //Init ports (do first ports because clocks do change ports)
    SetVCore(3);
    Init_Clock();                                               //Init clocks
    //Init_MPY();
    AFE44xx_PowerOn_Init();
    AFE44xx_PowerOff();       //关闭测量
    oledinit();               // Initialize OLED
    Init_KEY_Interrupt();
    HalBattMonInit();   //Initialize Battery monitor
    
    // Init UART to CC2530
    UART1_Config_Init();
    
